TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВнешниеПробы/гкс_ВнешниеПробы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ВнешниеПробы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПробы</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПробы</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДКомпозитнойПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоИнспекции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиКачестваWarehouse</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.гкс_ПродукцияWarehouse</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтанцияНазначения</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сюрвейер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Элеватор</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ВнешняяПроба/гкс_ВнешняяПроба.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ВнешняяПроба</name>
  <registerRecords>InformationRegister.гкс_ВнешниеПробы</registerRecords>
  <registerRecords>InformationRegister.гкс_ВнешниеПробыПоЗаявкамНаПеревозку</registerRecords>
  <registerRecords>InformationRegister.гкс_КонтрольЗаполненияВнешнихПроб</registerRecords>
  <attributes>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияWarehouse</name>
    <type>
      <types>CatalogRef.гкс_КонтрагентыWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураWarehouse</name>
    <type>
      <types>CatalogRef.гкс_ПродукцияWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДКомпозитнойПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправленияWarehouse</name>
    <type>
      <types>CatalogRef.гкс_СтанцииWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияНазначения</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияНазначенияWarehouse</name>
    <type>
      <types>CatalogRef.гкс_СтанцииWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сюрвейер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СюрвейерWarehouse</name>
    <type>
      <types>CatalogRef.гкс_КонтрагентыWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <comment>Контрольная сумма MD5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоИнспекции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетныйВидПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Элеватор</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлеваторWarehouse</name>
    <type>
      <types>CatalogRef.гкс_КонтрагентыWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаявок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗерновоза</name>
    <comment>Для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <comment>Для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КачественныеПоказатели</name>
    <attributes>
      <name>ТипВнешнейПробы</name>
      <type>
        <types>CatalogRef.гкс_ТипыВнешнихПробWarehouse</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПробы</name>
      <type>
        <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательВнешний</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиКачестваWarehouse</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявкиНаПеревозку</name>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВнешниеПробы/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс
 
// Процедура добавляет запись в регистр по переданным значениям структуры.
Процедура ДобавитьЗапись(Запись, Загрузка = Ложь) Экспорт
    
    гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(Запись, "гкс_ВнешниеПробы", Загрузка);
    
КонецПроцедуры

// Создает структуру, содержащую имена и значения измерений, ресурсов и реквизитов регистра сведений.
//
// Возвращаемое значение:
//  Структура - коллекция измерений ресурсов и реквизитов.
//
Функция СтруктураЗаписи() Экспорт
	
	Возврат ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(СоздатьМенеджерЗаписи(), 
								Метаданные.РегистрыСведений.гкс_ВнешниеПробы);
    
КонецФункции

// Процедура удаляет набор записей в регистре по переданным значениям структуры.
Процедура УдалитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	гкс_ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "гкс_ВнешниеПробы", Загрузка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьТаблицуВнешнейПробы() Экспорт
	
	ТипДата 					= Новый ОписаниеТипов("Дата");
	ТипЧисло					= Новый ОписаниеТипов("Число");
	ТипСтрока 					= Новый ОписаниеТипов("Строка");
	ТипВидПробы 				= Новый ОписаниеТипов("ПеречислениеСсылка.гкс_НазначенияИспользованияКачества");
	ТипПродукция 				= Новый ОписаниеТипов("СправочникСсылка.гкс_ПродукцияWarehouse");
	ТипПоказатель 				= Новый ОписаниеТипов("СправочникСсылка.гкс_ПоказателиКачестваWarehouse");
	ТипОрганизация              = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ТипКонтрагенты 				= Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ТипТочкиМаршрута 			= Новый ОписаниеТипов("СправочникСсылка.гкс_ТочкиМаршрута");
	ТипТранспортныеСредства 	= Новый ОписаниеТипов("СправочникСсылка.ТранспортныеСредства");
	ТипКлассификаторСтанцийЖД 	= Новый ОписаниеТипов("СправочникСсылка.гкс_КлассификаторСтанцийЖД");
		
	ТаблицаВнешниеПробы = Новый ТаблицаЗначений;
	// Значения шапки
	ТаблицаВнешниеПробы.Колонки.Добавить("Период",					ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ВидПробы",				ТипВидПробы);
	ТаблицаВнешниеПробы.Колонки.Добавить("ДатаПробы",				ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ДатаПогрузки", 			ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ДатаИзменения", 			ТипДата);
	ТаблицаВнешниеПробы.Колонки.Добавить("ИДКомпозитнойПробы", 		ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("ИДПробы", 				ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("Комментарий", 			ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("МестоИнспекции", 			ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("НомерДокумента", 			ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("НомерЗаявки", 			ТипСтрока);

	// Значение справочные
	ТаблицаВнешниеПробы.Колонки.Добавить("СтанцияОтправления", 		ТипКлассификаторСтанцийЖД);
	ТаблицаВнешниеПробы.Колонки.Добавить("СтанцияНазначения", 		ТипКлассификаторСтанцийЖД);
	ТаблицаВнешниеПробы.Колонки.Добавить("Сюрвейер", 				ТипКонтрагенты);
	ТаблицаВнешниеПробы.Колонки.Добавить("Элеватор", 				ТипТочкиМаршрута);
	ТаблицаВнешниеПробы.Колонки.Добавить("НомерТС", 				ТипСтрока);
	ТаблицаВнешниеПробы.Колонки.Добавить("ТранспортноеСредство", 	ТипТранспортныеСредства);
	ТаблицаВнешниеПробы.Колонки.Добавить("Показатель", 				ТипПоказатель);
	ТаблицаВнешниеПробы.Колонки.Добавить("Продукция", 				ТипПродукция);
	ТаблицаВнешниеПробы.Колонки.Добавить("Организация", 			ТипОрганизация);
	// Значение показателей
	ТаблицаВнешниеПробы.Колонки.Добавить("ВесБрутто", 				ТипЧисло);
	ТаблицаВнешниеПробы.Колонки.Добавить("ВесТары", 				ТипЧисло);
	ТаблицаВнешниеПробы.Колонки.Добавить("ВесНетто", 				ТипЧисло);
	ТаблицаВнешниеПробы.Колонки.Добавить("ЗначениеПоказателя", 		ТипЧисло);
	
	Возврат ТаблицаВнешниеПробы;
	
КонецФункции

Функция ВнешниеПробыПоВходящимДанным(ВнешняяПробаСсылка) Экспорт
	
	СтруктураДвижений = Документы.гкс_ВнешняяПроба.ДанныеДокументаДляПроведения(ВнешняяПробаСсылка, 
		Новый Структура("гкс_ВнешниеПробы, гкс_КонтрольЗаполненияВнешнихПроб"));
		
	Если СтруктураДвижений.Свойство("Таблицагкс_КонтрольЗаполненияВнешнихПроб") 
		И Не ЗначениеЗаполнено(СтруктураДвижений.Таблицагкс_КонтрольЗаполненияВнешнихПроб) Тогда
		Результат = СтруктураДвижений.Таблицагкс_ВнешниеПробы;
	Иначе
		Результат = Неопределено;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
